In [1]:
import pandas as pd
import numpy as np

In [2]:
animals = ["tiger", "lion", "cat"]
pd.Series(animals)

0    tiger
1     lion
2      cat
dtype: object

In [3]:
animals = ["tiger", "lion", None]
pd.Series(animals)

0    tiger
1     lion
2     None
dtype: object

In [4]:
sports = {'Archery': 'Bhutan',
          'Golf': 'Scotland',
          'Sumo': 'Japan',
          'Taekwondo': 'South Korea'}
s = pd.Series(sports)
s

Archery           Bhutan
Golf            Scotland
Sumo               Japan
Taekwondo    South Korea
dtype: object

In [5]:
s["Archery"]

'Bhutan'

In [6]:
s.index

Index(['Archery', 'Golf', 'Sumo', 'Taekwondo'], dtype='object')

In [7]:
s = pd.Series(["tiger", "bear", "moose"], index=["india", "america", "canada"])
s

india      tiger
america     bear
canada     moose
dtype: object

In [8]:
sports = {'Archery': 'Bhutan',
          'Golf': 'Scotland',
          'Sumo': 'Japan',
          'Taekwondo': 'South Korea'}
s = pd.Series(sports, index=["Golf", "Sumo", "Hockey"])
s

Golf      Scotland
Sumo         Japan
Hockey         NaN
dtype: object

In [9]:
s.loc["Golf"]

'Scotland'

In [10]:
sports = {'Archery': 'Bhutan',
          'Golf': 'Scotland',
          'Sumo': 'Japan',
          'Taekwondo': 'South Korea'}
s = pd.Series(sports)
s.iloc[3]

'South Korea'

In [11]:
s[3]

'South Korea'

In [12]:
sports = {99: 'Bhutan',
          100: 'Scotland',
          101: 'Japan',
          102: 'South Korea'}
s = pd.Series(sports)
s

99          Bhutan
100       Scotland
101          Japan
102    South Korea
dtype: object

In [13]:
s[100]

'Scotland'

In [14]:
s = pd.Series([100.00, 120.00, 101.00, 3.00])
s

0    100.0
1    120.0
2    101.0
3      3.0
dtype: float64

In [15]:
s.sum()

324.0

In [16]:
sum = 0
for i in s:
    sum += i
print(sum)

324.0

In [17]:
s = pd.Series(np.random.randint(0, 1000, 10000))
s.head()

0    304
1    221
2    270
3    516
4    317
dtype: int32

In [18]:
%%timeit -n 100
sum = 0
for i in s:
    sum += i

1.36 ms ± 444 µs per loop (mean ± std. dev. of 7 runs, 100 loops each)

In [19]:
%%timeit -n 100
sum = s.sum()

71.6 µs ± 10.2 µs per loop (mean ± std. dev. of 7 runs, 100 loops each)

In [23]:
original_sports = pd.Series({'Archery': 'Bhutan',
                             'Golf': 'Scotland',
                             'Sumo': 'Japan',
                             'Taekwondo': 'South Korea'})
cricket_loving_countries = pd.Series(['Australia', 'Barbados', 'Pakistan', 'England'], 
                                     index = ["Cricket", "Cricket", "Cricket", "Cricket"])
original_sports = original_sports.append(cricket_loving_countries)

In [24]:
original_sports

Archery           Bhutan
Golf            Scotland
Sumo               Japan
Taekwondo    South Korea
Cricket        Australia
Cricket         Barbados
Cricket         Pakistan
Cricket          England
dtype: object

In [26]:
purchase_1 = pd.Series({'Name': 'Chris',
                        'Item Purchased': 'Dog Food',
                        'Cost': 22.50})
purchase_2 = pd.Series({'Name': 'Kevyn',
                        'Item Purchased': 'Kitty Litter',
                        'Cost': 2.50})
purchase_3 = pd.Series({'Name': 'Vinod',
                        'Item Purchased': 'Bird Seed',
                        'Cost': 5.00})
df = pd.DataFrame([purchase_1, purchase_2, purchase_3], index=["Store 1", "Store 2", "Store 1"]) 
df

          Name Item Purchased  Cost
Store 1  Chris       Dog Food  22.5
Store 2  Kevyn   Kitty Litter   2.5
Store 1  Vinod      Bird Seed   5.0

In [29]:
df.loc["Store 1"]

          Name Item Purchased  Cost
Store 1  Chris       Dog Food  22.5
Store 1  Vinod      Bird Seed   5.0

In [30]:
df.loc["Store 2"]

Name                     Kevyn
Item Purchased    Kitty Litter
Cost                       2.5
Name: Store 2, dtype: object

In [33]:
df.T.loc["Cost"]

Store 1    22.5
Store 2     2.5
Store 1       5
Name: Cost, dtype: object

In [34]:
df["Cost"]

Store 1    22.5
Store 2     2.5
Store 1     5.0
Name: Cost, dtype: float64

In [37]:
df.loc["Store 2"]["Cost"]

2.5

In [38]:
df.loc["Store 2"]["Name"]

'Kevyn'

In [39]:
df.drop("Store 1")

          Name Item Purchased  Cost
Store 2  Kevyn   Kitty Litter   2.5

In [40]:
df

          Name Item Purchased  Cost
Store 1  Chris       Dog Food  22.5
Store 2  Kevyn   Kitty Litter   2.5
Store 1  Vinod      Bird Seed   5.0

In [41]:
df = df.drop("Store 2")
df

          Name Item Purchased  Cost
Store 1  Chris       Dog Food  22.5
Store 1  Vinod      Bird Seed   5.0

In [42]:
purchase_1 = pd.Series({'Name': 'Chris',
                        'Item Purchased': 'Dog Food',
                        'Cost': 22.50})
purchase_2 = pd.Series({'Name': 'Kevyn',
                        'Item Purchased': 'Kitty Litter',
                        'Cost': 2.50})
purchase_3 = pd.Series({'Name': 'Vinod',
                        'Item Purchased': 'Bird Seed',
                        'Cost': 5.00})
df = pd.DataFrame([purchase_1, purchase_2, purchase_3], index=["Store 1", "Store 2", "Store 1"])
df_copy = df.copy()
df_copy

          Name Item Purchased  Cost
Store 1  Chris       Dog Food  22.5
Store 2  Kevyn   Kitty Litter   2.5
Store 1  Vinod      Bird Seed   5.0

In [43]:
df_copy.drop("Store 1")

          Name Item Purchased  Cost
Store 2  Kevyn   Kitty Litter   2.5

In [44]:
df

          Name Item Purchased  Cost
Store 1  Chris       Dog Food  22.5
Store 2  Kevyn   Kitty Litter   2.5
Store 1  Vinod      Bird Seed   5.0

In [46]:
del df_copy["Name"]
df_copy

        Item Purchased  Cost
Store 1       Dog Food  22.5
Store 2   Kitty Litter   2.5
Store 1      Bird Seed   5.0

In [47]:
df["Location"] = None
df

          Name Item Purchased  Cost Location
Store 1  Chris       Dog Food  22.5     None
Store 2  Kevyn   Kitty Litter   2.5     None
Store 1  Vinod      Bird Seed   5.0     None

In [50]:
df["Cost"] *= 0.5
df

          Name Item Purchased   Cost Location
Store 1  Chris       Dog Food  11.25     None
Store 2  Kevyn   Kitty Litter   1.25     None
Store 1  Vinod      Bird Seed   2.50     None

In [51]:
costs = df["Cost"]
costs

Store 1    11.25
Store 2     1.25
Store 1     2.50
Name: Cost, dtype: float64

In [53]:
costs +=4
costs

Store 1    15.25
Store 2     5.25
Store 1     6.50
Name: Cost, dtype: float64